// LabforBab1.cpp: определяет точку входа для консольного приложения.
//

#include "stdafx.h"
#include <locale>
#include <Windows.h>
#include "iostream"

using namespace std;


int main()
{
	//setlocale(LC_ALL, "Rus");
	SetConsoleCP(1251);
	SetConsoleOutputCP(1251);
	cout << "Бойко Владислав Леонтиевич." << endl;
	cout << "Родился 15 сентября 1998 года в одном городе в Украине 90-тых." << endl;
	cout << "Был тепло принят его родителями, потому что являлся их сыном." << endl;
	cout << "Детсво прошло в радости и любви." << endl;
	cout << "Потому что ни один родственник тогда не умер." << endl;
	cout << "Очень не любил в школу, в начальных классах учился очень плохо." << endl;
	cout << "В средней школе - очень хорошо." << endl;
	cout << "В старших классах - ну нормально." << endl;
	cout << "Еще в школьные годы любил рисовать." << endl;
	cout << "Но сейчас не любит." << endl;
	cout << "В шестом классе отдали в музыкальную школу. Но он не любил музыку." << endl;
	cout << "Но сейчас любит." << endl;
	cout << "Раньше не читал." << endl;
	cout << "Но сейчас умеет." << endl;
	cout << "Играю с музыкой." << endl;
	cout << "Играю в музыку." << endl;
	cout << "Скоро ЗНО, нужно было решить, куда поступить." << endl;
	cout << "Как на счет Киева, ну или Харькова? Решааай!" << endl;
	cout << "Точно, Винница, у тебя же там отец живет, и мать." << endl;
	cout << "Такс, ты сдаешь ЗНО." << endl;
	cout << "Здаешь." << endl;
	cout << "Здаешь." << endl;
	cout << "Здаешь." << endl;
	cout << "Здаешь." << endl;
	cout << "Все плохо сдал." << endl;
	cout << "Больше скажу, я очень все плохо сдал." << endl;
	cout << "Поскольку денег нет, остается мне только быть никем." << endl;
	cout << "Остается решать устроиться на работу. Кем же мне быть?" << endl;
	cout << "Спектр выбора не мал, я могу быть автомойщиком, курьером или летсплеером." << endl;
	cout << "Естественно я стал курьером." << endl;
	cout << "Я так счастлив, все гда хотел путишествовать. По своему селу." << endl;
	cout << "Со временем я получил задание доставить важную посылку. Жаль, я не придал этому значения." << endl;
	cout << "Я стал лэтсплеером. Я настолько счастлив." << endl;
	cout << "Мой ютуб канал начал набирать много подписчиков. Я начал получать много дохода." << endl;
	cout << "Однажды, во время работы мне стало очень плохо и мне вызвали скорую." << endl;
	cout << "В клинике мне сказали, что у меня рак мозга. Все были шокированы." << endl;
	cout << "Видимо, мне не стоило быть ЛэтсПлейщейком." << endl;

	system("pause");
}

